# Series object is a one dimensional array

In [4]:
import pandas as pd
s1 = pd.Series([1,2,3,4,5],)
print(type(s1))
s1

<class 'pandas.core.series.Series'>

0    1
1    2
2    3
3    4
4    5
dtype: int64

# CHANGING INDEX

In [7]:
s1 = pd.Series([1,2,3,4,5], index = ['a','b','c','d','e']) #<=method_one

s1.index = ['a','b','c','d','e']   #<=method_two

s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

# SERIES OBJECT AS DICTIONARY

In [13]:
import pandas as pd
s2 = pd.Series({'a' : 1, 'b': 2,'c' : 3, 'd' : 4, 'e' : 5}, index = ['b', 'c', 'a', 'e', 'd']) # ismy key and value dono jaga change krhi hai
print(s2)
s2.index = ['b', 'c', 'a', 'e', 'd'] # just index change horhi h value same hai
s2

b    2
c    3
a    1
e    5
d    4
dtype: int64

b    2
c    3
a    1
e    5
d    4
dtype: int64

# EXTRACT VALUES FROM  ARRAY

In [ ]:
l1 =[1,2,3,4,5,6,7,8,9,10]
s1 = pd.Series(l1)
print(s1[5])
print(s1[1:])
print(s1[4:])
print(s1[-4:])

# MULTIDIMENSIONAL DATA (DataFrame)

In [14]:
# data frame contain rows and column
d1 = pd.DataFrame({'Name': ['shahzaib', 'mujtaba', 'rafay'],'Marks': [80,75,77], 'Address':['Sector L-1', 'Sector 5a1', 'Safora']})
d1

       Name  Marks     Address
0  shahzaib     80  Sector L-1
1   mujtaba     75  Sector 5a1
2     rafay     77      Safora

# DataFrame in-build function

In [15]:
import pandas as pd
iris = pd.read_csv('Data.csv')
iris.head() # for 1st five records

        Name  physics  Chemistry  Maths
0  Shahzaib        56         67     45
1     Sufyan       60         49     55
2      Rafay       62         56     77
3  Shahzaib        56         67     45
4     Sufyan       60         49     55

In [16]:
iris.tail() # for last five records

         Name  physics  Chemistry  Maths
10     Sufyan       60         49     55
11      Rafay       62         56     77
12  Shahzaib        56         67     45
13     Sufyan       60         49     55
14      Rafay       62         56     77

In [17]:
iris.shape # check to know how many rows and columns

(15, 4)

In [18]:
iris.describe() # Describe all importants operations

         physics  Chemistry      Maths
count  15.000000  15.000000  15.000000
mean   59.333333  57.333333  59.000000
std     2.581989   7.668737  13.835771
min    56.000000  49.000000  45.000000
25%    56.000000  49.000000  45.000000
50%    60.000000  56.000000  55.000000
75%    62.000000  67.000000  77.000000
max    62.000000  67.000000  77.000000

In [19]:
iris.iloc[0:3, 1:3]

   physics  Chemistry  Maths
0       56         67     45
1       60         49     55
2       62         56     77

In [ ]:
iris.loc[0:5, ('Name','physics',"Chemistry")] #=> first and last rows k dono index inclusive hen

In [ ]:
iris.drop('Chemistry',axis=1) # axis=0 is for rows and,,,,, axis=1 is for column

In [ ]:
iris.drop([1,2], axis = 0)

# MORE PANDAS FUNCTIONS

In [ ]:
iris.min()

In [ ]:
iris.max()

In [ ]:
iris.mean()

In [ ]:
iris.median()

In [ ]:
iris

In [ ]:
def Half(s):
    return s*0.5
iris[['physics', 'Chemistry','Maths']].apply(Half)

In [ ]:
iris['Name'].value_counts()

In [ ]:
iris.sort_values(by= 'Name')